---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyFamilyName
source: html/56d68b3f-36ff-182e-9cf3-b16382ea48d5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyFamilyName Property

Can't [Action] because Family '[Family Name]' is different in the two documents. Update the documents to contain the same version of the Family.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyFamilyName { get; }
```